---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitSettings.ConnectorSeparator
source: html/29dbaeb4-7b01-5ce9-e2e9-940da3735d52.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSettings.ConnectorSeparator Property

The conduit connector separator string.

## Syntax (C#)
```csharp
public string ConnectorSeparator { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null